{"format": "keras", "nodes": [{"name": "sequential_input", "id": "sequential_input", "class_name": "InputLayer", "output_shape": [[null, 160, 160, 3]], "num_parameters": 0}, {"name": "sequential", "id": "sequential", "class_name": "Sequential", "output_shape": [null, 160, 160, 3], "num_parameters": 0}, {"name": "rescaling", "id": "rescaling", "class_name": "Rescaling", "output_shape": [null, 160, 160, 3], "num_parameters": 0}, {"name": "conv2d", "id": "conv2d", "class_name": "Conv2D", "output_shape": [null, 160, 160, 16], "num_parameters": 448}, {"name": "max_pooling2d", "id": "max_pooling2d", "class_name": "MaxPooling2D", "output_shape": [null, 80, 80, 16], "num_parameters": 0}, {"name": "conv2d_1", "id": "conv2d_1", "class_name": "Conv2D", "output_shape": [null, 80, 80, 29], "num_parameters": 4205}, {"name": "max_pooling2d_1", "id": "max_pooling2d_1", "class_name": "MaxPooling2D", "output_shape": [null, 40, 40, 29], "num_parameters": 0}, {"name": "conv2d_2", "id": "conv2d_2", "class_name": "Conv2D", "output_shape": [null, 40, 40, 64], "num_parameters": 16768}, {"name": "max_pooling2d_2", "id": "max_pooling2d_2", "class_name": "MaxPooling2D", "output_shape": [null, 20, 20, 64], "num_parameters": 0}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 20, 20, 64], "num_parameters": 0}, {"name": "flatten", "id": "flatten", "class_name": "Flatten", "output_shape": [null, 25600], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 3276928}, {"name": "dense_1", "id": "dense_1", "class_name": "Dense", "output_shape": [null, 1], "num_parameters": 129}], "edges": [["sequential_input", "sequential"], ["sequential", "rescaling"], ["rescaling", "conv2d"], ["conv2d", "max_pooling2d"], ["max_pooling2d", "conv2d_1"], ["conv2d_1", "max_pooling2d_1"], ["max_pooling2d_1", "conv2d_2"], ["conv2d_2", "max_pooling2d_2"], ["max_pooling2d_2", "dropout"], ["dropout", "flatten"], ["flatten", "dense"], ["dense", "dense_1"]]}